[
  {
    "title": "GapFinder",
    "Desc": "GapFinder is an AI-driven learning companion designed to identify gaps in a learner's knowledge and provide a personalized roadmap for improvement. By leveraging the Gemini API, the system curates tailored study resources, related projects, and community reviews based on the user's input topic and knowledge level.",
    "key": [
      "Personalized Roadmaps: Generates structured learning paths tailored to the user's knowledge level and goals.",
      "AI-Driven Insights: Uses the Gemini API to identify knowledge gaps and recommend curated resources.",
      "Project Suggestions: Provides project ideas related to the chosen topic to help users gain practical experience.",
      "Community Reviews: Integrates feedback from peers to guide learners toward high-quality resources.",
      "Interactive Experience: Engages users with a clean and responsive interface for an enjoyable learning journey."
    ],
    "image": "gap",
    "Stacks": [
      "React.js",
      "Node.js",
      "Express.js",
      "Gemini API",
      "MongoDB",
      "Axios for API calls",
      "Tailwind CSS"
    ]
  },
  {
    "title": "Campus Event Management",
    "Desc": "Campus Event Management is a comprehensive web application designed to streamline event planning and participation on campus. It allows students and organizers to manage, promote, and track events efficiently. The platform features moderator access for content management and provides users with real-time event updates and participation statistics.",
    "key": [
      "Event Creation & Management: Organizers can create, edit, and manage campus events easily.",
      "Moderator Access: Provides controlled content management to ensure event data accuracy.",
      "Participation Tracking: Displays real-time statistics of student participation in events.",
      "Announcements & Notifications: Keeps users informed with updates and reminders about upcoming events.",
      "Responsive Design: User-friendly interface accessible on both desktop and mobile devices."
    ],
    "image": "campus",
    "Stacks": [
      "React.js",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Firebase Authentication",
      "Tailwind CSS",
      "Recharts for statistics visualization"
    ]
  },

  {
    "title": "Port folio",
    "Desc": "My Portfolio is a stylish web application that showcases my projects and skills. It features an intuitive design with sections for my work, experience, and contact details. The portfolio is responsive and built with modern web technologies, providing a visually appealing presentation of my professional journey.",
    "image": "port",
    "Stacks": [
      "HTML5",
      "CSS for styling",
      "JavaScript (ES6+)",
      "React Js"
    ]
  }
]
